
// for 반복문
// for (초기식; 조건식; 증감식) {반복전으로 실행해야 된느 코드}

// for 문을 만나면 초기식에 적어놓은 변수를 세팅 함
// 실행순서 : 초기식-> 조건식 -> 실행코드 -> 증감식 -> 조건식 실행코드 -> 증감식 -> 조건식이 false면 끝
// 초기식: 하나의 변수를 할당해서 값을 집어넣는 식
// 조건식 : 반복을 해도 된느지 따지는 식 -> 초기식의 변수를 통한 비교식을 세움
for (var i = 1; i <= 3; i++) {
    console.log(i + "번째 반복");
}

// 1. 초기식떄 i = 1
// 2. 조건문에서 1 <= 3 을 보면 true값 '실행해도 된다'  ㄱ
// 3. 코드블록인 console.log( "1번쩨 반복"); 이 실행됨    1사이클
// 4. 증감식인 i++이 실행되어 i=2   -^
// 5. 조건문에서 2 <= 3 을 보면 true값 '실행해도 된다'  ㄱ
// 6. 코드블록인 console.log("2번쩨 반복"); 이 실행됨  2사이클
// 7. 증감식인 i++이 실행되어 i = 3   -^
// 8. 조건문에서 3 <= 을 보면 true값 '실행도 된다'   ㄱ
// 9. 코드 블록인 console.log("3번째 반복"); 이 실행됨  3사이클
// 10. 증감식인 i++이 실행되어 i+4  -^
// 11. 조건문에서 4 <= 4를 보면 false 값이 되어 '끝내' 가 된다   => 4사이클에서 마무리 지어짐


//1무터 10까지 더하기
var aum = 0;
for (var n = 0; n < 10; n++) {
    sum += n;  // sum = sum + n;
}
// 첫번쨰 싸이클 :  sum = sum + n;  //  sum 0, n = 0 + 1 = 1
// 두번쨰 싸이클 :  sum = sum + n;  //  sum 1, n = 1 + 2 = 3
// 세번쨰 싸이클 :  sum = sum + n;  //  sum 3, n = 3 + 3 = 6
// 네번쨰 싸이클 :                  //  sum 0, n = 0 + 1 = 1







// 중첩 반복문 : 그냥 for문 안에 for문을 쓰는 것

// 구구단! 2단만 만들어 보면
for (var dan = 2; dan < 9; n++) {
}
for (k = 2; k <= 9; k++) {
    console.log(`2 * ${4} = ${2*k}`)
}
